<?php
// Повторить третье задание, но вывести на экран только города, начинающиеся с буквы «К».


$map = [
    "Московская область" => ["Москва", "Зеленоград", "Клин"],
    "Ленинградская область" => ["Санкт-Петербург", "Всеволожск", "Павловск", "Кронштадт"],
    "Рязанская область" => ["Рязань", "Михайлов", "Скопин", "Касимов"],
];

foreach ($map as $obl => $cities) {
    echo "$obl:<br>";

    $kCities = [];
    foreach ($cities as $city) {
        $firstLetter = str_split($city, 2)[0]; // гребаная кодировка, кириллические символы идут по цене двух
        if ($firstLetter == "К") $kCities[] = $city;
    }

    echo implode($kCities, ", ")."<br>";
}